// Back4App server
const back4AppInfo = {
    url_1: 'https://parseapi.back4app.com/classes/Schedule/ujMZdzqmbL',
    url_2: 'https://parseapi.back4app.com/classes/Notices/Eah1g4UkkD',
    headers: {
        'X-Parse-Application-Id': 'wlZezVWuR0xG3VDM2SPqvEuSPE66bKspj5iKigGL',
        'X-Parse-REST-API-Key': 'a0cX24dr7zCbVXCMWWmC8OQrDtKXvBsQ4AOd4bNA',
        'Content-Type': 'application/json'
    }
};

const back4appBodyObject = {
    "ScheduleArr": [
        {
            "date": "03.01.2022",
            "day": "понеделник",
            "description": "-Празнуваме големия християнски празник Свето Преображение Господне!!! Честит празник! След празничната Св.Литургия ще се отслужи Благодарствена молитва и водосвет. Заповядайте!/n- Св.Литургия - Начало: 09:00\n- Вечерня - Начало: 17:00"
        },
        {
            "date": "04.01.2022",
            "day": "вторник",
            "description": "- Утреня - Начало: 08:00\n- Св.Литургия - Начало: 09:00\n- Вечерня - Начало: 17:00"
        },
        {
            "date": "05.01.2022",
            "day": "сряда",
            "description": "- Утреня - Начало: 08:00\n- Св.Литургия - Начало: 09:00\n- Вечерня - Начало: 17:00"
        },
        {
            "date": "06.01.2022",
            "day": "четвъртък",
            "description": "- Утреня - Начало: 08:00\n- Св.Литургия - Начало: 09:00\n- Вечерня - Начало: 17:00"
        },
        {
            "date": "07.01.2022",
            "day": "петък",
            "description": "- Утреня - Начало: 08:00\n- Св.Литургия - Начало: 09:00\n- Вечерня - Начало: 17:00"
        },
        {
            "date": "08.01.2022",
            "day": "събота",
            "description": "- Утреня - Начало: 08:00\n- Св.Литургия - Начало: 09:00\n- Вечерня - Начало: 17:00"
        },
        {
            "date": "09.01.2022",
            "day": "неделя",
            "description": "- Утреня - Начало: 08:00\n- Св.Литургия - Начало: 09:00\n- Вечерня - Начало: 17:00"
        }
    ]
};

// SoftUni server
const softUniServer = {
    url_1: 'http://localhost:3030/jsonstore/schedule/storage',
    url_2: 'http://localhost:3030/jsonstore/notices/storage',
    headers: {
        'Content-Type': 'application/json'
    }
};

const softUniBodyObject = [
    {
        "date": "03.01.2022",
        "day": "понеделник",
        "description": "-Празнуваме големия християнски празник Свето Преображение Господне!!! Честит празник! След празничната Св.Литургия ще се отслужи Благодарствена молитва и водосвет. Заповядайте!/n- Св.Литургия - Начало: 09:00\n- Вечерня - Начало: 17:00"
    },
    {
        "date": "04.01.2022",
        "day": "вторник",
        "description": "- Утреня - Начало: 08:00\n- Св.Литургия - Начало: 09:00\n- Вечерня - Начало: 17:00"
    },
    {
        "date": "05.01.2022",
        "day": "сряда",
        "description": "- Утреня - Начало: 08:00\n- Св.Литургия - Начало: 09:00\n- Вечерня - Начало: 17:00"
    },
    {
        "date": "06.01.2022",
        "day": "четвъртък",
        "description": "- Утреня - Начало: 08:00\n- Св.Литургия - Начало: 09:00\n- Вечерня - Начало: 17:00"
    },
    {
        "date": "07.01.2022",
        "day": "петък",
        "description": "- Утреня - Начало: 08:00\n- Св.Литургия - Начало: 09:00\n- Вечерня - Начало: 17:00"
    },
    {
        "date": "08.01.2022",
        "day": "събота",
        "description": "- Утреня - Начало: 08:00\n- Св.Литургия - Начало: 09:00\n- Вечерня - Начало: 17:00"
    },
    {
        "date": "09.01.2022",
        "day": "неделя",
        "description": "- Утреня - Начало: 08:00\n- Св.Литургия - Начало: 09:00\n- Вечерня - Начало: 17:00"
    }
];